---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtEndSchedulesTagsFilters
source: html/0822cd9a-32fb-beed-a3a9-53dc744071c4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtEndSchedulesTagsFilters Property

"Hook Rotation At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookRotationAtEndSchedulesTagsFilters { get; }
```